/* global Professions */

Professions.descriptions = {
    "Blacksmith": "대장장이는 갑옷, 기어 등의 장비를 만들어냅니다!",
    "Tailor": "제국에서 가장 로맨틱한 직업. 우아한 옷을 만들고 아름다운 그림을 그립니다.",
    "Alchemyst": "거의 모든 사람들이 존경하는 연금술사. 그들은 원자를 통제하고 신기한 기계를 만들며, 강력한 마법이 깃든 두루마리를 사용합니다.",
    "Farmer": "식량조달의 중심. 그들은 모든 것들을 재배합니다. 힘들고 참을성이 있는 사람들입니다.",
    "Carpenter": "사람들에게 필요한 아름다운 도구와 건물을 만드는 사람들입니다.",
    "Cook": "로갈리아의 요리사는 맛있고, 비타민이 가득한 요리를 만들어냅니다.",
    "Hunter": "야생에서 살아남는 법을 아는 사람들입니다. 안전한 장소와 먹을 음식을 찾고, 조심스럽고 민첩하여 야수와의 전투에서 승리합니다.",
};
