Craft.help = {
    "stick": "Чтобы получить палку кликните правой кнопкой мыши по суку, добытому с любого дерева, и выберите пункт <сломать>",
    "twig": "Чтобы получить прутик кликните правой кнопкой мыши по ветке, добытой с любого дерева, и выберите пункт <сломать>",
    "stone": "Камень можно <отколоть> киркой от каменной глыбы, булыжника или просто поднять с земли",
    "leather": "Сырую кожу нужно высушить на сушилке, затем полученную высушенную шкуру нужно вымочить в дубильном тазу.",
};
