/* global Quest */

Quest.quests =  {
    "tutorial-start": {
        name: "Start",
        desc: [
            "你好，菜鸟！",
            "到达这里的每个人都得到了我的教导，我的工作就是教你们生存的基础。",
        ],
        final: "太好了，让我们开始吧！",
    },
    "craft-1": {
        name: "采摘资源",
        desc: [
            "你需要一些工具来生存在这片荒野，而工具需要资源来制作",
            "收集4块石头, 2根树枝和1根嫩枝",
        ],
        tip: "右键树，取得树枝和嫩枝，石头可以从地上捡起",
    },
    "craft-1-2": {
        name: "做一个刀柄",
        desc: "现在我们有了树枝和嫩枝，我们将它们加工一下",
        tip: "在背包里右键物品，点击折断，折断树枝得到树棍，折断嫩枝得到枝条",
    },
    "craft-2": {
        name: "做刀刃",
        desc: "刀应该有一个刀片，试着用尖锐的石头做出来。",
        tip: "点击尖锐石头的图标，打开制造菜单，点击制作",
    },
    "craft-2-1": {
        name:  "做一把刀",
        desc: "完美，万事俱备了，现在让我们做一把小刀出来",
    },
    "craft-3": {
        name: "做一件武器",
        desc: "“好，现在装备上小刀，让我们制作一把锋利的棍棒，你的第一把武器，你会需要它。",
        tip: "在背包里右键再单击装备",
    },
    "stat-1": {
        name: "饥渴度",
        desc: "现在我会教你如何获得食物和水。从树上获取一些树皮，做一个杯子，然后在水边装满水，别担心，这里的水很干净",
        tip: "靠近水，背包里右键做好的杯子，选择填满，然后你可以选择喝水了",
    },
    "stat-2": {
        name: "饥饿度",
        desc: [
            "现在是时候获得一些食物了，从树上摘一些苹果。",
            "请小心，不要再吃撑了，否则食物不会给你维生素，而且你变慢了。",
            "顺便说一句，如果你已经吃撑了，就用我旁边的厕所（拉出来吧）。",
        ],
    },
    "fight": {
        name: "战斗组合",
        desc: "嗯，我看你准备好了你的第一场战斗。装备你的锋利的棍棒，攻击一个训练假人",
        tip: "技能按钮和热键可以在左下部面板中找到，快捷键选择攻击方式，鼠标移动选择攻击范围，单击攻击。试一试吧！",
    },
    "finish": {
        name: "教程结束",
        desc: "嗯，我做了我的工作。",
        final: "是时候回到城市了！"
    },
    "claim-get-license": {
        name: "许可证",
        desc: "你好，新手，钱是世界上最不能没有的东西！最好不要带上许多钱去冒险，我会教你保护你的隐私，你知道你可以把现金留在我的银行吗？这可以保护你的财产！",
        tip: "你可以从斯科罗吉那得到银行许可证（在银行找到他）。",
    },
    "claim-build": {
        name: "建家",
        desc: [
            "这会花费你一些钱，是的，但是非常值得！",
            "你可以用土地权在任何自由的地方建立你的领地，并进一步扩张。",
            "不要急，明智选择，每当你想移动它，还是另外买一个，我们都会收取你的费用",
            "在附近放一个重生的石头，这样你不会失去这个地方，并迅速回到你的领地。",
        ],
    },
    "claim-extend": {
        name: "扩张",
        desc: "对你来说，你可以扩大自己的领地，但是不要忘记租金也会增加，总是关注你的银行帐户，检查是否有足够的租金，否则你有失去领地的风险并转而不受保护",
        final: "好像要完成了，现在你可以自己建立的领地，当然，人们还是可以抢劫你，但现在你可以惩罚这个罪行，现在法律会保护你，顺便去拜访屠夫吧，他似乎有话要说你。"
    },
    "tp-return-home": {
        name: "回家" ,
        desc: "你对传送阵感兴趣吗？我会告诉你你在世界各地旅行的方式。当你在地面上，在Synode保护下，你可以很容易的回到你的宅基地。你应该建一个复活石，试一试。",
        "tip": "右键点击你的头像（见屏幕的左上角），点击回家",
    },
    "tp-respawn": {
        name: "重生点",
        desc: "城镇重生的石头连接到你重生的石头。你可以使用重生的石头旅行，但是它的主要任务是在死后重建你的身体，当你建立自己的重生石时，你会注意到它看起来与别人不同。",
        tip: "使用重生石吧，你其实已经不是原本的你了"
    },
    "tp-scrolls": {
        name: "卷轴",
        desc: "传送卷轴允许你从非常危险的地方回家，当你探索地下时，他们会帮助你。我会给你一些，但你可以自己买或自己做。",
    },
    "faction-daily-1": {
        name: "阵营任务（每日）",
        desc: "增加你在阵营中的地位",
    },
    "garland-daily": {
        name: "花环任务（每日）",
        desc: "帮助圣诞老人做花环",
    },
    "chrismas-flags-daily": {
        name: "小旗子任务（每日）",
        desc: "帮助圣诞老人的女儿做一些小旗子",
    },
    "chrismas-decoration-daily-2": {
        name: "纸装饰（每日）",
        desc: "帮助圣诞老人的女儿做一些纸装饰",
    },
    "chrismas-decoration-daily-1": {
        name: "玻璃装饰（每日）",
        desc: "帮助圣诞老人的女儿做一些玻璃装饰",
    },
    "chrismas": {
        name: "圣诞帽",
        desc: "圣诞快乐，新年快乐！给你一个圣诞帽子！",
        final: "这是你的圣诞帽",
        customReward: "圣诞帽",
    },
    "chrismas-presents": {
        name: "圣诞礼物（每日）",
        desc: "终于完成了！圣诞节快乐！你想要礼物吗？",
        final: "这是你的礼物！",
    },
    "buy-small-indulgence": {
        name: "小救赎",
        desc: [
            "你总是可以在这里得到救赎。",
        ],
        customReward: "+100 业力",
    },
    "buy-average-indulgence": {
        name: "普通救赎",
        desc: [
            "你总是可以在这里得到救赎。",
        ],
        customReward: "+1000 业力",
    },
    "buy-big-indulgence": {
        name: "大救赎",
        desc: [
            "你总是可以在这里得到救赎。",
        ],
        customReward: "+10000 业力",
    }
};
