/* global Settings */

Settings.descriptions = {
    character: {
        pathfinding: [
            "Поиск пути",
            "Активирует поиск пути.",
        ],
        hideHelmet: [
            "Спрятать шлем",
            "Не показывать шлем. Другие игроки так же не увидят ваш шлем.",
        ],
        rotateWasd: [
            "Повернуть WASD",
            "Двигаться по координатам карты, а не экрана",
        ],
        autoTarget: [
            "Автовыбор цели",
            "Автоматически выбирать ближайшую к курсору цель.",
        ],
    },
    ui: {
        language: [
            "Язык",
            "Переключает язык игры.",
        ],
        hp: [
            "Полоска здоровья",
            "Показывать полоску здоровья над персонажем.",
        ],
        name: [
            "Ник",
            "Показывать ники персонажей.",
        ],
        npc: [
            "NPC",
            "Включить настройки ник/полоска здоровья для NPC",
        ],
        minimapObjects: [
            "Объекты миникарты",
            "Показывать объекты на миникарте.",
        ],
        allowSelfSelection: [
            "Выделение персонажа",
            "Разрешить взаимодействовать с персонажем мышкой. Правая кнопка активирует действие с большой кнопки.",
        ],
        fillClaim: [
            "Закрашивать клейм",
            "Закрашивает область клейма.",
        ],
        strokeClaim: [
            "Границы клейма",
            "Отображает границы клеймов.",
        ],
        chatAttached: [
            "Прикрепить чат",
            "Прикрепить чат или сделать отдельным окошком.",
        ],
        chatBalloons: [
            "Пузыри сообщений",
            "Показывает пузыри с сообщениями над головами персонажей.",
        ],
        chatEnterBlur: [
            "Enter в пустом чате",
            "Нажатие клавиши Enter в пустом чате убирает с него фокус.",
        ],

        showAttackRadius: [
            "Радиус атаки",
            "Показывать радиус атаки персонажей.",
        ],
        comboHelper: [
            "Комбо",
            "Показывать подсказки для комбо.",
        ],
    },
    graphics: {
        snowflakes: [
            "Снежинки",
            "Рисовать падающий снег",
        ],
        movingSpace: [
            "Движение космоса",
            "Включить движение космоса на краю карты.",
        ],
        autoHighlightDoors: [
            "Подсвечивать дверь",
            "Позволяет подсвечивать дверь при наведении курсора. При отключенной опции через ctlr.",
        ],
        autoHideWalls: [
            "Автоскрытие стен",
            "Автоматически скрывать стены внутри помещений.",
        ],
        centerScreen: [
            "Центрировать экран",
            "При включенной опции игровая область располагается по центру экрана",
            "При выключенной — у левого края.",
        ],
    },
    sound:  {
        playSound: [
            "Звуки",
            "Включить звуки игры.",
        ],
        playMusic: [
            "Музыка",
            "Включить музыку в игре.",
        ],
        soundVolume: [
            "Громкость звуков",
            "Громкость различных эффектов.",
        ],
        musicVolume: [
            "Громкость музыки",
            "Громкость фоновой музыки.",
        ],
        voiceVolume: [
            "Громкость голоса",
            "Громкость голоса нпц.",
        ],
        jukebox: [
            "Музыкальный автомат",
            "Включить музыку из музыкальных автоматов.",
        ],
        chatNotifications: [
            "Оповещения чата",
            "Показывать оповещения чата в трее",
        ],
    }
};
