Settings.descriptions = {
    character: {
        pathfinding: [
            "経路探索",
            "経路探索をONにします。",
        ],

        hideHelmet: [
            "頭装備を非表示",
            "頭装備を非表示にする。他のプレイヤーからも見えなくなります。",
        ],
        rotateWasd: [
            "WASDでの移動方向",
            "地図に基づき、WASDで東西南北へ移動するようになります。",
        ],
        autoTarget: [
            "自動ターゲット",
            "最も近いものを自動的に選択します。",
        ],
        obstacleAvoidance: [
            "障害物回避",
            "障害物にぶつかると少しだけ回避するようになります。",
        ],
    },
    ui: {
        language: [
            "言語",
            "日本語、英語、ロシア語のいずれかを選択して、言語設定を切り替えることができます。",
        ],
        hp: [
            "ヘルスバー",
            "キャラクターの頭上にヘルスバーを表示する。",
        ],
        name: [
            "名前表示",
            "キャラクターの頭上に名前を表示する。",
        ],
        npc: [
            "NPC名前・ヘルスバー表示",
            "NPCの頭上に名前とヘルスバーを表示する。",
        ],
        minimapObjects: [
            "ミニマップ",
            "ミニマップ上にアイテムを表示する。",
        ],
        allowSelfSelection: [
            "キャラクターセレクト",
            "キャラクターの選択とマウス操作が可能になります。 右ボタンはアクティブ・アクションに割り当てられます。",
        ],
        fillClaim: [
            "所有地・範囲表示",
            "所有地範囲を塗りつぶします。",
        ],
        strokeClaim: [
            "所有地・境界線表示",
            "所有地範囲に境界線を引きます。",
        ],
        chatAttached: [
            "ピン・チャット",
            "チャットウィンドウを固定します。",
        ],
        chatBalloons: [
            "メッセージ・バブル",
            "キャラクターの頭上にチャットメッセージを表示します。",
        ],
        chatEnterBlur: [
            "エンターキーでチャットのフォーカスを外す",
            "チャット入力欄が空欄の時、エンターキーでフォーカスを外します。",
        ],
        showAttackRadius: [
            "攻撃範囲",
            "攻撃範囲を表示します。",
        ],
        comboHelper: [
            "コンボ",
            "コンボを表示します。",
        ],

    },
    graphics: {
        snowflakes: [
            "雪の表示",
            "雪の表示を制限します。",
        ],
        movingSpace: [
            "背景アニメーション",
            "フィールド端の背景に表示される宇宙のアニメーションを有効にします。",
        ],
        autoHideWalls: [
            "壁を自動的に隠す",
            "建物内に入ると、壁を自動的に隠します。",
        ],
        autoHighlightDoors: [
            "ドアの強調表示",
            "マウス・カーソルでドアを強調表示します。 無効にすると、Ctrlキーを押すとドアが強調表示されます。",
        ],
        centerScreen: [
            "センタースクリーン",
            "有効にすると、ゲームエリアは画面中央に配置されます。 無効にすると、ゲームエリアが左に配置されます。",
        ],
        autoHideObjects: [
            "物体を自動的に隠す",
            "建築物や木などの物体を自動的に隠します。",
        ],
        semiTransparentWalls: [
            "壁を半透明にする",
            "壁を半透明にします。",
        ],
        gpuRender: [
            "ファスト・レンダリング",
            "一部グラフィックを簡略化します。",
            "※選択するとタイトル画面に戻ります。",
        ],
        topologicalSort: [
            "トポロジカルソート",
            "建物や設置物の表示順序を正しく表示します。 ※パフォーマンスが低下する場合があります。",
        ],
    },
    sound:  {
        playSound: [
            "サウンド",
            "ゲームサウンド",
        ],
        playMusic: [
            "環境音",
            "環境音",
        ],
        soundVolume: [
            "サウンド音量",
            "エフェクト音量",
        ],
        musicVolume: [
            "音楽",
            "ＢＧＭの音量",
        ],
        voiceVolume: [
            "ボイス",
            "ＮＰＣ音量",
        ],

        jukebox: [
            "ジュークボックス",
            "ジュークボックスで音楽聞く",
        ],
        chatNotifications: [
            "チャット通知",
            "チャット通知を表示する",
        ],
    }
};
