/* global Quest */

Quest.quests =  {
    "tutorial-start": {
        name: "Start",
        desc: [
            "你好，菜鳥！",
            "到達這裡的每個人都得到了我的教導，我的工作就是教你們生存的基礎。",
        ],
        final: "太好了，讓我們開始吧！",
    },
    "craft-1": {
        name: "採摘資源",
        desc: [
            "你需要一些工具來生存在這片荒野，而工具需要資源來製作",
            "收集4塊石頭, 2根樹枝和1根嫩枝",
        ],
        tip: "右鍵樹，取得樹枝和嫩枝，石頭可以從地上撿起",
    },
    "craft-1-2": {
        name: "做一個刀柄",
        desc: "現在我們有了樹枝和嫩枝，我們將它們加工一下",
        tip: "在背包里右鍵物品，點擊折斷，折斷樹枝得到樹棍，折斷嫩枝得到枝條",
    },
    "craft-2": {
        name: "做刀刃",
        desc: "刀應該有一個刀片，試着用尖銳的石頭做出來。",
        tip: "點擊尖銳石頭的圖標，打開製造菜單，點擊製作",
    },
    "craft-2-1": {
        name:  "做一把刀",
        desc: "完美，萬事俱備了，現在讓我們做一把小刀出來",
    },
    "craft-3": {
        name: "做一件武器",
        desc: "“好，現在裝備上小刀，讓我們製作一把鋒利的棍棒，你的第一把武器，你會需要它。",
        tip: "在背包里右鍵再單擊裝備",
    },
    "stat-1": {
        name: "饑渴度",
        desc: "現在我會教你如何獲得食物和水。從樹上獲取一些樹皮，做一個杯子，然後在水邊裝滿水，別擔心，這裡的水很乾凈",
        tip: "靠近水，背包里右鍵做好的杯子，選擇填滿，然後你可以選擇喝水了",
    },
    "stat-2": {
        name: "飢餓度",
        desc: [
            "現在是時候獲得一些食物了，從樹上摘一些蘋果。",
            "請小心，不要再吃撐了，否則食物不會給你維生素，而且你變慢了。",
            "順便說一句，如果你已經吃撐了，就用我旁邊的廁所（拉出來吧）。",
        ],
    },
    "fight": {
        name: "戰鬥組合",
        desc: "嗯，我看你準備好了你的第一場戰鬥。裝備你的鋒利的棍棒，攻擊一個訓練假人",
        tip: "技能按鈕和熱鍵可以在左下部面板中找到，快捷鍵選擇攻擊方式，鼠標移動選擇攻擊範圍，單擊攻擊。試一試吧！",
    },
    "finish": {
        name: "教程結束",
        desc: "嗯，我做了我的工作。",
        final: "是時候回到城市了！"
    },
    "claim-get-license": {
        name: "許可證",
        desc: "你好，新手，錢是世界上最不能沒有的東西！最好不要帶上許多錢去冒險，我會教你保護你的隱私，你知道你可以把現金留在我的銀行嗎？這可以保護你的財產！",
        tip: "你可以從斯科羅吉那得到銀行許可證（在銀行找到他）。",
    },
    "claim-build": {
        name: "建家",
        desc: [
            "這會花費你一些錢，是的，但是非常值得！",
            "你可以用土地權在任何自由的地方建立你的領地，並進一步擴張。",
            "不要急，明智選擇，每當你想移動它，還是另外買一個，我們都會收取你的費用",
            "在附近放一個重生的石頭，這樣你不會失去這個地方，並迅速回到你的領地。",
        ],
    },
    "claim-extend": {
        name: "擴張",
        desc: "對你來說，你可以擴大自己的領地，但是不要忘記租金也會增加，總是關注你的銀行帳戶，檢查是否有足夠的租金，否則你有失去領地的風險並轉而不受保護",
        final: "好像要完成了，現在你可以自己建立的領地，當然，人們還是可以搶劫你，但現在你可以懲罰這個罪行，現在法律會保護你，順便去拜訪屠夫吧，他似乎有話要說你。"
    },
    "tp-return-home": {
        name: "回家" ,
        desc: "你對傳送陣感興趣嗎？我會告訴你你在世界各地旅行的方式。當你在地面上，在Synode保護下，你可以很容易的回到你的宅基地。你應該建一個復活石，試一試。",
        "tip": "右鍵點擊你的頭像（見屏幕的左上角），點擊回家",
    },
    "tp-respawn": {
        name: "重生點",
        desc: "城鎮重生的石頭連接到你重生的石頭。你可以使用重生的石頭旅行，但是它的主要任務是在死後重建你的身體，當你建立自己的重生石時，你會注意到它看起來與別人不同。",
        tip: "使用重生石吧，你其實已經不是原本的你了"
    },
    "tp-scrolls": {
        name: "捲軸",
        desc: "傳送捲軸允許你從非常危險的地方回家，當你探索地下時，他們會幫助你。我會給你一些，但你可以自己買或自己做。",
    },
    "faction-daily-1": {
        name: "陣營任務（每日）",
        desc: "增加你在陣營中的地位",
    },
    "garland-daily": {
        name: "花環任務（每日）",
        desc: "幫助聖誕老人做花環",
    },
    "chrismas-flags-daily": {
        name: "小旗子任務（每日）",
        desc: "幫助聖誕老人的女兒做一些小旗子",
    },
    "chrismas-decoration-daily-2": {
        name: "紙裝飾（每日）",
        desc: "幫助聖誕老人的女兒做一些紙裝飾",
    },
    "chrismas-decoration-daily-1": {
        name: "玻璃裝飾（每日）",
        desc: "幫助聖誕老人的女兒做一些玻璃裝飾",
    },
    "chrismas": {
        name: "聖誕帽",
        desc: "聖誕快樂，新年快樂！給你一個聖誕帽子！",
        final: "這是你的聖誕帽",
        customReward: "聖誕帽",
    },
    "chrismas-presents": {
        name: "聖誕禮物（每日）",
        desc: "終於完成了！聖誕節快樂！你想要禮物嗎？",
        final: "這是你的禮物！",
    },
    "buy-small-indulgence": {
        name: "小救贖",
        desc: [
            "你總是可以在這裡得到救贖。",
        ],
        customReward: "+100 業力",
    },
    "buy-average-indulgence": {
        name: "普通救贖",
        desc: [
            "你總是可以在這裡得到救贖。",
        ],
        customReward: "+1000 業力",
    },
    "buy-big-indulgence": {
        name: "大救贖",
        desc: [
            "你總是可以在這裡得到救贖。",
        ],
        customReward: "+10000 業力",
    }
};

