/* global Achievements */

"use strict";

Achievements.descriptions = {
    "get-trained-by-plato" : {
        name: "Окей. Как тут победить?",
        desc: "пройти обучение у Платона.",
    },
    "extend-claim": {
        name: "Я здесь надолго",
        desc: "продлить аренду клейма",
    },
    "plant-1000-seeds": {
        name: "Я думал, это весёлая ферма",
        desc: "посадить 1000 семян",
    },
    "fry-100-mushrooms": {
        name: "Грибник",
        desc: "пожарить 100 грибов",
    },
    "plough-3000-tiles": {
        name: "Комбайн Урал",
        desc: "вспахать 3000 клеток земли",
    },
    "get-lvl-18": {
        name: "Больше не ребёнок",
        desc: "получить 18-ый уровень",
    },
    "get-lvl-50": {
        name: "Юбилей",
        desc: "получить 50-ый уровень",
    },
    "get-lvl-100": {
        name: "Старый дед",
        desc: "получить 100 уровень",
    },
    "any-skill-100": {
        name: "Мастер своего дела",
        desc: "любой 1 навык прокачан на 100",
    },
    "three-skills-100" : {
        name: "На все руки мастер",
        desc: "3 любых навыка прокачаны на 100",
    },
    "all-stats-100" : {
        name: "Сверхчеловек",
        desc: "все статы прокачаны на 100",
    },
    "strength-100" : {
        name: "Сила",
        desc: "сила 100",
    },
    "vitality-100": {
        name: "Живучесть",
        desc: "живучесть 100"
    },
    "dexterity-100": {
        name: "Ловкость",
        desc: "ловкость 100",
    },
    "intellect-100": {
        name: "Интеллект",
        desc: "интеллект 100",
    },
    "perception-100": {
        name: "Восприятие",
        desc: "восприятие 100",
    },
    "wisdom-100": {
        name: "Мудрость",
        desc: "мудрость 100",
    },
    "dig-300-tiles-underground" : {
        name: "Копальщик",
        desc: "прокопать 300 клеток под землёй",
    },
    "dig-1000-ore" : {
        name: "Глубокая шахта",
        desc: "выкопать 1000 единиц любой руды",
    },
    "all-combo-100" : {
        name: "Мастер боевых комбо",
        desc: "выполнить 100 комбо",
    },
    "win-100-arena" : {
        name: "Гладиатор",
        desc: "победить на арене 100 раз",
    },
    "win-500-arena" : {
        name: "Спартак",
        desc: "победить на арене 500 раз",
    },
    "chudo-yudo" : {
        name: "Чудо-Юдо",
        desc: "выловить рыбу Чудо-Юдо",
    },
    "cut-down-300-trees" : {
        name: "Враг Гринписа",
        desc: "срубить 300 деревьев",
    },
    "kill-abu" : {
        name: "Да придет эра мэйлача",
        desc: "убить Абу",
    },
    "kill-omich" : {
        name: "Посвященный в Омичи",
        desc: "убить Омска",
    },
    "kill-preved" : {
        name: "Превед из 2006!",
        desc: "убить Превед-Медведа",
    },
    "kill-wyvern" : {
        name: "Оседлавший небо!",
        desc: "убить Виверну",
    },
    "kill-all-bosses" : {
        name: "Боссы-мемосы",
        desc: "убить всех боссов",
    },
    "killed-by-player": {
        name: "В рай или ад?",
        desc: "быть убитым игроком",
    },
    "kill-player": {
        name: "А это весело!",
        desc: "убить игрока",
    },
    "eat-shit" : {
        name: "А это точно съедобно?",
        desc: "съесть какашку",
    },
    "buy-sex" : {
        name: "Продажная любовь",
        desc: "купить секс у Марго",
    },
    "craft-bloody-armor" : {
        name: "Хозяин крови",
        desc: "скрафтить Кровавый комплект брони",
    },
    "all-vitamins-100": {
        name: "Допинг",
        desc: "накопить все витамины по 100",
    }
};
